label ill_prologue:
    $ ill_chapter(0)
    scene bg black with dissolve
    $ renpy.pause(4.5, hard=True)
    play sound ill_sfx_photo
    scene bg black with flash
    play music ill_mus_bda_nw fadein 5
    #scene anim prolog_1 with dissolve
    $ soznanie("anim prolog_1")
    window show
    "Мягкий, голубоватый свет вспышки осветил счастливые и улыбающиеся лица."
    "Они неживые, словно маски, которые просто смотрят тебе в душу и пытаются ухватиться за неё; пытаются нащупать углы и выпуклости, в которые можно было бы впиться цепкими щупальцами, и утащить к себе в подземелье."
    "И хоть их маски и изображают радостные улыбки, а их глаза, подобные кукольным, просто светятся счастьем - в их застывших лицах всё равно есть что-то очень пугающее."
    "Как будто в симбиозе отдельных элементов правильных, красивых лиц получатся лишь кошмар, который будет преследовать тебя ночами.{w} А, может, даже и днями…"
    "И всё это кажется таким… ненастоящим.{w} Эти нелепые куклы с масками застыли в настолько неестественных позах, что кажется, что это попросту марионетки, а не только что совершившие обряд бракосочетания муж и жена."
    "Всё фальшиво. Но они будут называть эту фотографию \"памятью\"."
    "Быть может, муж поставит эту фотографию в рамочку, у себя в офисе, а его любимая жена украсит ей свадебный фотоальбом…"
    "Фотоальбом, который будет гореть так же ярко и сильно, как и чувства сейчас.{w} Потом он начнёт тлеть, как и их влечение друг к другу, а потом и вовсе всё погаснет."
    "И дальше каждый из них встанет перед выбором: жить дальше, как ни в чём не бывало, как они привыкли до этого, играя чувства в своём “кукольном” театре, либо же разойтись и попытаться повторить этот бессмысленный цикл снова."
    "И тот, и тот выбор ведёт к краху.{w} Краху человека, как личности, ибо в первом случае он предаёт себя, а во-втором – своё окружение."
    "Предательство – одна из самых худших вещей, которые только могут случиться в жизни человека.{w} Ведь она – Госпожа неожиданность, которая спускает курок тебе в затылок, когда ты думаешь, что лучше у тебя ничего быть не может."
    "И ведь не укроешься от этого.{w} Вечно ждёшь подвоха, никому не доверяешь, никого не подпускаешь."
    "Но всегда найдётся тот, кто сквозь тернии придёт к тебе и всё же добьётся своего.{w} Как и в случае со мной, и этим непутёвым женихом.{w} Схемы однотипны."
    'Через два-три месяца его начнёт пилить жена за невымытую посуду.{w} Через полгода – упрекать в том, что он не может забить дома и гвоздя.{w} А он, в свою очередь, начнёт злиться на неё за то, что она недосолила суп или плохо пробежалась с пылесосом по квартире.'
    "И всё это будет копиться, копиться и копиться.{w} До тех пор, пока один не предаст."
    "Всегда так было и всегда так будет.{w} Не зря наш дорогой Александр Сергеевич завещал “любить самого себя”.{w} Ибо любви к другому либо вовсе нет изначально, либо она гаснет со временем."
    "Быть циничным эгоистом – цель или проклятие двадцать первого века?"
    "Скорее уж избавление.{w} Избавление от чувств, от лишних нервотрёпок и предательств.{w} Тонкий хитиновый покров, который, однако, довольно сложно разбить, если ты того сам не захочешь."
    window hide
    play sound ill_sfx_photo
    scene anim prolog_1 with flash
    window show
    "Никогда не любил свадьбы.{w} Сплошной бал лицемеров, где все, кроме жениха и невесты, делают вид, что нравятся друг другу."
    "И ты вынужден сновать между столами, которые ломятся от угощений, и фотографировать влюблённую парочку; то в такой романтичной позе у фонтана, то лёжа у него на коленях, в саду, то имитируя сцену из “Титаника” всё у того же фонтана…"
    "Глупо.{w} Предсказуемо.{w} Бессмысленно.{w} Вскоре, эти фотографии останутся лишь воспоминаниями, и насколько бы сентиментальной не была девушка, или парень – даже она скоро перестанет обращать на них внимание."
    "И ведь они свято верят, что всё это будет не так.{w} Что они особенные, что совместная жизнь продлится у них до конца их жизней."
    "Но это не так. Глупая иллюзия, в которую верят каждый новобрачный, вскоре рассыплется о твёрдую, немного угловатую, реальность."
    "И когда с них слетят розовые очки, будет очень сложно жить в серых тонах.{w} Но ничего не поделаешь.{w} Они сами заработали себе своё же проклятие."
    window hide
    play sound ill_sfx_photo
    scene anim prolog_1 with flash
    window show
    "И все эти мысли, словно рой пчёл, кружатся и мельтешат в голове у какого-то “никчёмного” фотографа.{w} Никто меня не спросит об этом, а если и спросит, то лишь посмеются."
    ill_marry_guest "Ну серьёзно, что может знать какой-то двадцатилетний парнишка о таком высоком чувстве, как любовь?"
    "Только они не знают, что мне давно уже не двадцать.{w} Не знаю почему, но я всегда выглядел моложе моих лет."
    "Наверное, как раз-таки потому, что я вовремя остановился и сохранил хоть какие-то остатки своих нервов, и живу теперь в своё удовольствие."
    "Но, увы. Никто мне не поверит, а мне и не надо ничего никому доказывать.{w} Каждый должен сам разбиться о собственные амбиции."
    "А я ещё не слишком стар, чтобы толкать проповеди молодым и говорить о том, насколько наше поколение пропащее.{w} В конце концов, тридцать лет – не приговор."
    "В этом возрасте жизнь только начинается. И тратить её на бессмысленные споры о том, что внимания не заслуживает - глупо."
    window hide
    play sound ill_sfx_photo
    scene anim prolog_1 with flash
    window show
    "Иногда, в мягком свечении вспышки, которая появляется лишь на секунду, я вижу то, как только начинается мой путь."
    "Детский сад, школа, институт…{w} Всё это настолько банально, что даже и рассказывать никому не хочется.{w} Всё тоже самое, что и других.{w} Отличие лишь в мелочах, но они настолько незаметны, что их, как будто бы, и нет."
    "Самое интересное начинается тогда, когда я только начал делать свои первые снимки и брать за это деньги.{w} Да, получалось кособоко, не очень качественно, но и цена была соответствующая, так что люди знали, на что шли."
    "Единственное, что было у меня профессионального – камера.{w} Подарок от мамы, которая целиком и полностью поддерживала моё увлечение, и всё время, пока я учился, она копила на неё."
    "Я до сих пор помню, как я со слезами на глаза кинулся ей на шею, получив заветную коробочку.{w} И первой же моей фотографией была именно она.{w} Отпечаток моей памяти, который я берегу, сам не знаю для чего."
    "Её давно уже нет со мной, и смысла в фотографии я этой не вижу, ибо она лишь служит больным напоминанием…{w} Но я её не трогаю."
    stop music fadeout 3
    "Наверное, я просто так отдаю дань уважения своей самой родной женщине… Но почему-то мне кажется, что я просто обманываю самого себя…"
    window hide
    play sound ill_sfx_photo
    scene anim prolog_1 with flash
    window show
    "Но… иногда я просто так выходил на улицу, чтобы просто так пофоткать всё, что только попадётся мне на глаза.{w} Дождевые капли на лавочке, колыхание листьев на ветру."
    "Я игрался с фокусом, светом, расположением предмета в кадре, и с каждым разом получалось всё лучше и лучше."
    "Но однажды…{w} На лавочке, в той аллее, в которой я обычно тренировал себя в роли фотографа, сидела девушка."
    "Обычная, ничем не примечательная девушка, которая просто так сидела и смотрела на небо.{w} И это меня и удивило.{w} Нечасто увидишь человека «не от мира сего», особенно в таком месте."
    "Обычно его оккупировали местные алкаши или подростки с колонкой и ужасной музыкой, но никак не девушки, которые просто так смотрят на ясное небо.{w} Я невольно заострил свой взгляд на ней."
    "Небесного цвета глаза, слегка вьющиеся рыжие волосы, тонкие, женственные руки, и абсолютно мечтательное, детское выражение лица."
    "Но она, казалось, вовсе меня не замечала – просто сидела и смотрела ввысь, не обращая внимания на того, кто уже минут десять на неё просто пялится."
    "Её правильные черты лица буквально светились в свете уходящего солнца, а кончики рыжих локонов изредка вспыхивали огнём."
    $ ill_meet('ill_kira', u"Девушка")
    $ set_mode_nvl()
    ill_kira "Чего стоишь? Фотографировать собираешься или ты пришёл просто меня порассматривать? А, может, ты и не на меня смотришь вовсе?"
    ill_kira "Знаешь, эта лавочка тоже может казаться в какой-то мере привлекательной, при определённом освещении и определённым градусом алкоголя в крови."
    $ set_mode_adv()


label ill_prologue_3:
    scene bg ill_kir_house with dissolve
    $ m_msg = []
    $ msg_name = "Unknown Number"
    "Наконец, дверь моей квартиры передо мной отворилась, и я смог лицезреть своё маленькое, но уютное гнёздышко, во всей его красе."
    "Чистота комнаты радовала глаз, а пара шкафов так и манила пестрыми названиями книг, коими они были переполнены."
    "Хотелось взять одну из них, приготовить чашечку кофе, устроиться поудобнее на кресле и с упоением погрузиться в вымышленные миры...{w} Но ноющие мышцы говорили мне об обратном."
    "Недавно купленный ноутбук, крася своим экраном три стены в слегка синеватый цвет, приглушённо сообщал о том, что ему требуется подзарядка."
    "На подоконнике взгромоздилось старое, но всё ещё хорошо работающее, радио.{w} Я не включал его, казалось, уже целую тысячу лет, но всё же не решался его убрать, так как за всё время, проведённое здесь, он стал полноценной частью интерьера."
    "Я сразу же плюхнулся в кровать, желая тут же заснуть, будто я только что перетаскал кучу мешков с цементом - всё тело болело, будто это было на самом деле."
    "Мир снаружи, за закрытыми окнами, дышал холодом.{w} Ветер закручивал спиралями пыль и обрывки бумаги; и, хотя светило солнце, а небо было резко тёмно-голубым, все в городе выглядело бесцветным."
    "Включая солипсиста, так легко было представить, что во всём мире теперь только так — промозгло, холодно и приглушенно-шумно. За окном наконец-то стало тихо."
    "Тишина, словно чернила, проникающие в щели на крыше и окнах. Она была чересчур громкой, отталкивающей, напряжённой."
    "Казалось, что вот сейчас, резко появится какой-нибудь звук, который напугает меня или заставит проснуться во второй раз, но всё было спокойно."
    "Я решил, что потянуть с заказом как можно дольше – очень хорошая идея."
    "Многие люди думают, что это всё это делается из-за вредности фотографа, или кого-то ещё, клуба анонимных масонов, тамплиеров – кого угодно, но только не из-за них самих."
    "Чаще всего, они сами ведут себя настолько мерзотно, насколько это вообще."
    window hide
    show screen ill_messenger
    with dissolve
    python:
        ill_msg("Добрый вечер. Вы же Кир Громов, верно?", who=True)
        ill_msg("Да, это я. Вас что-то интересует?")

#    $ ill_get_achievement("prologue")
